{
    "samples": [
        {
            "Patent Class": "Digital Healthcare",
            "Positive Sample": "The present invention relates to a telemedical stethoscope, which automatically diagnoses a disease, and records visually and auditorily, and stores the stethoscope data on a screen. The present invention enhances primary diagnosis and treatment effect for a patient by transmitting/receiving the data to/from a doctor at a medical center and by receiving a telemedicine service. In addition, the present invention transmits the data to a health management program so as to be used for personal healthcare and disease prognosis decision of a patient.",
            "Negative Sample": "An implantable sensor array incorporates active electronic elements to greatly increase the number of sensors and their density that can be simultaneously recorded and activated. The sensors can be of various configurations and types, for example: optical, chemical, temperature, pressure or other sensors including effectors for applying signals to surrounding tissues. The sensors/effectors are arranged on a flexible and stretchable substrate with incorporated active components that allow the effective size, configuration, number and pattern of sensors/effectors to be dynamically changed, as needed, through a wired or wireless means of communication.",
            "Reason": "The positive sample involves healthcare analytics and data transmission, key aspects of digital healthcare, while the negative sample describes an implantable sensor array for tissue interaction, which does not focus on healthcare management or remote care."
        },
        {
            "Patent Class": "Sustainable Farming",
            "Positive Sample": "There is a need for a selective, low-risk herbicide that can be used to control weeds in cereal cultures and turf. The present invention discloses that a bacterial secondary metabolite, thaxtomin and optionally another herbicide is an effective herbicide on broadleaved, sedge and grass weeds. Thaxtomin A and structurally similar compounds can be used as natural herbicides to control the germination and growth of weeds in cereal, turf grass, Timothy grass and pasture grass cultures with no phytotoxicity to these crops. As a natural, non-toxic compound, thaxtomin can be used as a safe alternative for weed control in both conventional and organic farming and gardening systems.",
            "Negative Sample": "The single-foot drivable skate and skateboard is constituted of the simultaneously steering-driving mechanism, synchronous differential driving mechanism, wheel and board. The simultaneously steering-driving mechanism comprises a universal pedal, the driving-steering rod and the single pole truck. The single pole truck pivotally supports the board with a pivot joint or ball joint. The driving-steering rod slides in the slot passing through the pivotal joint and the truck. The synchronous differential driving mechanism made of the noncontact gripping force or the upper-bounded gripping force includes the engaging drums shifted by the shift screws.",
            "Reason": "The positive sample discusses a natural herbicide that aligns with sustainable farming through organic practices, while the negative sample describes a mechanical skateboard system, which is unrelated to agriculture or sustainability."
        },
        {
            "Patent Class": "Autonomous Vehicles",
            "Positive Sample": "The present invention is directed to a virtual pan/tilt camera system and method for use with vehicles, and particularly ground vehicles (MGVs). The invention utilizes autonomous navigation systems (ANSs) used with pan/tilt cameras, but eliminates the pan/tilt cameras substituting a plurality of video cameras. Each video camera is mounted in a fixed orientation on the vehicle and covers a selected angular range of lateral view. Commands from the ANS are mapped to selected addresses where the video data from the video cameras are stored, and appropriately transformed data from the selected addresses are input to the ANS.",
            "Negative Sample": "A pillow drape for use with a thermal medical treatment apparatus or device is provided. The drape includes a sterilized sheet for covering the warming medical device that covers the device body and a basin that is used to store a warming liquid. The pillow drape includes an enclosure having a support member therein to support a medical instrument, such as a surgical scope, during warming of the scope.",
            "Reason": "The positive sample is focused on autonomous vehicle navigation and video systems, fitting with autonomous vehicles, while the negative sample is about a thermal medical device cover, which has no connection to self-driving technology."
        },
        {
            "Patent Class": "Artificial Intelligence",
            "Positive Sample": "A knowledge tree building system iteratively partitions a database of case records into a tree of conceptually meaningful clusters. Each cluster is automatically assigned a unique conceptual meaning in accordance with its unique pattern of typicality and exceptionality within the knowledge tree; no prior domain-dependent knowledge is required. The system fully utilizes all available quantitative and qualitative case record data.",
            "Negative Sample": "Light is reflected from a cantilever, and the reflected light, except that part which is reflected from the back of the cantilever, is applied to a light-receiving device. A distance between the probe of the cantilever and a sample is determined in accordance with changes in the light in order to protect both the sample and the probe.",
            "Reason": "The positive sample describes a knowledge tree system for AI pattern classification, which fits AI applications, whereas the negative sample focuses on a mechanical system involving light reflection and cantilevers, unrelated to AI."
        },
        {
            "Patent Class": "3D Printing",
            "Positive Sample": "An additive manufacturing process that includes providing a first layer of powdered material having a predetermined thickness; using a laser beam that follows a predetermined path to fuse a portion of the material in the first layer; providing a second layer of powdered material having a predetermined thickness; using a laser beam that follows a predetermined path to fuse a portion of the material in the second layer; repeating the previous steps until a complete part or component is created.",
            "Negative Sample": "A plasma flame spray gun suitable for being constructed physically smaller than comparable power prior art plasma flame spray guns. The gun includes a nozzle having a tapering portion on the inlet side thereof. A cathode with a flat tip is positioned to at least partially extend into the tapering portion of the nozzle.",
            "Reason": "The positive sample discusses an additive manufacturing process using laser beams to fuse powdered material, directly relevant to 3D printing, while the negative sample is about a plasma spray gun, which is unrelated to additive manufacturing."
        },
        {
            "Patent Class": "Virtual Reality",
            "Positive Sample": "Disclosed are methods and systems for a virtual reality simulation and display of limb movement that facilitate the development and fitting of prosthetic control of a paralyzed or artificial limb. The user generates command signals that are then processed by the control system. The output of the control system drives a physics-based simulation of the limb that simulates the limb to be controlled.",
            "Negative Sample": "A high security, inexpensive and versatile manner of locking firearms within a theft proof gun rack. The apparatus comes in two embodiments for use with long guns or pistols and utilizes a locking bar which locks the firearm within a given partition within the gun rack.",
            "Reason": "The positive sample is a virtual reality simulation of limb movement, aligning with virtual reality applications, while the negative sample describes a gun locking mechanism, which has no connection to VR technology."
        },
        {
            "Patent Class": "Nanotechnology",
            "Positive Sample": "A method of forming an implant to be implanted into living bone is disclosed. The method comprises the act of roughening at least a portion of the implant surface to produce a microscale roughened surface. The method further comprises the act of immersing the microscale roughened surface into a solution containing hydrogen peroxide and a basic solution to produce a nanoscale roughened surface consisting of nanopitting superimposed on the microscale roughened surface.",
            "Negative Sample": "A self-contained, compact and portable powder spray booth and powder recovery system includes a base unit, and a separate booth removably mounted upon the base unit which can be easily customized to accommodate articles of varying shape and size without changing the design of the base unit.",
            "Reason": "The positive sample involves creating nanoscale surfaces for implants, which is closely related to nanotechnology, while the negative sample describes a powder spray booth system, which is unrelated to nanoscale manipulation."
        }
    ]
}